Revit 2027 API
TableSectionData.SetColumnWidth Method
 Sets a column's width in feet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetColumnWidth(
	int nCol,
	double width
)
Public Sub SetColumnWidth (
	nCol As Integer,
	width As Double
)
public:
void SetColumnWidth(
	int nCol,
	double width
)
member SetColumnWidth :
        nCol : int *
        width : float -> unit
Parameters
nCol Int32
width Double
Exceptions
Exception | Condition
ArgumentException |  The given column number nCol is invalid. -or- The column width is outside of acceptable range.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace